#+TITLE:Variables and Assignments
#+AUTHOR: Marcus Birkenkrahe
#+SUBTITLE: See also King chapter 2 - for CSC 100 Intro to Programming in C/C++
#+STARTUP: overview hideblocks
#+OPTIONS: toc:nil num:nil ^:nil
#+PROPERTY: header-args:C :main yes
#+PROPERTY: header-args:C :includes <stdio.h>
#+PROPERTY: header-args:C :exports both
* Formatting printout

  * We use the built-in (via ~stdio.h~) function ~printf~ to print

  * In the code [[int print]], ~%d~ is a placeholder for an ~int~:
    #+name: int print
    #+begin_src C
      int height;  // type declaration
      height = 8;  // variable assignment

      printf("The height is: %d\n", height); // formatted printout
    #+end_src

  * In [[float print]], ~%f~ is used to print a ~float~:
    #+name: float print
    #+begin_src C
      float profit;       // type declaration
      profit = 2150.48f;  // variable assignment

      printf("The profit is: $%f\n", profit); // formatted printout
    #+end_src

  * By default, ~%f~ displays the result with six digits. To change
    it to ~p~ digits, put ~.p~ between ~%~ and ~f~. E.g. to print it
    with 2 digits, ~p=2~:
    #+name: p digits
    #+begin_src C
      float profit;       // type declaration
      profit = 2150.48f;  // variable assignment

      printf("The profit is: $%.2f\n", profit); // formatted printout
    #+end_src

  * What happens when you get the formatting wrong?  in [[format_test]],
    we print a ~float~ first correctly, then with the wrong format
    identifier, and then the other way around.
    #+name: format_test
    #+begin_src C :results raw
      float foo;  // defined float
      foo = 3.14f;   // assigned float
      printf("%.2f\n",foo);  // formatted float as float
      printf("%d\n",foo);  // formatted float as int

      int bar;  // defined int
      bar = 314;   // assigned int
      printf("%d\n",bar);  // formatted int as int
      printf("%.2f\n",bar);  // formatted int as float
    #+end_src

    #+RESULTS: format_test
    3.14
    1610612736
    314
    3.14

* Putting it all together (C program)

  * Shipping fees are based on volume instead of weight. For the
    conversion, the volume is divided by 166. If the result exceeds
    the actual weight, the shipping fee is based on the "dimensional
    weight"[fn:5].

  * We write a program to compute the dimensional ~weight~ of a box of
    given ~volume~ - we use ~/~ for division. Let's say the box is
    12'' x 10'' x 8 ''. What does [[box_error]] need to run?
    #+name: box_error
    #+begin_src C
      volume = 12 * 10 * 8
        weight = volume / 166
    #+end_src

  * Fixed the errors in [[box]]. The compiler no longer complains, but
    we don't see anything. How can we print the result?
    #+name: box
    #+begin_src C
      int weight, volume;
      volume = 12 * 10 * 8;
      weight = volume / 166;
    #+end_src

  * The code in [[box_print]] prints the result of the computation.
    #+name: box_print
    #+begin_src C
      int weight, volume;     // declare variable types
      volume = 12 * 10 * 8;   // compute value
      weight = volume / 166;  // assign and compute values
      printf("The dimensional weight is %d\n",weight); // print result
    #+end_src

    #+RESULTS: box_print
    : The dimensional weight is 5

  * This is not what we need. When dividing one integer by another, C
    "truncates" the answer - the result is rounded down, but the
    shipping company wants us to round up. This can be achieved by
    adding 165 to the volume before dividing by 166[fn:6] as shown in
    [[dweight]].
    #+name: dweight
    #+begin_src C
      int weight, volume;     // declare variable types
      volume = 12 * 10 * 8;   // compute value
      weight = (volume + 165) / 166;  // assign and compute values
      printf("The dimensional weight is %d\n",weight); // print result
    #+end_src

  * Now for the final program [[dweight_c]]. This time, we allow for
    tangling the program as ~dweight.c~.
    #+name: dweight_c
    #+begin_src C :tangle dweight.c :results raw
      #include <stdio.h>

      int main(void)
      {
        // declare variable types
        int height, length, width, volume, weight;

        // variable assignments
        height = 8;
        length = 12;
        width = 10;
        volume = height * length * width;
        weight = (volume + 165) / 166;

        // print results
        printf("Dimensions: %dx%dx%d\n", length, width, height);
        printf("Volume (cubic inches): %d\n", volume);
        printf("Dimensional weight (pounds): %d\n", weight);

        return 0;
      }
    #+end_src

